espressif/esp-protocols/components/eppp_link/examples/emac2emac/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32"
CONFIG_LWIP_PPP_SUPPORT=y
CONFIG_LWIP_PPP_SERVER_SUPPORT=y
CONFIG_LWIP_PPP_VJ_HEADER_COMPRESSION=n
CONFIG_LWIP_PPP_DEBUG_ON=y
CONFIG_EPPP_LINK_DEVICE_ETH=y
